# iTunes Media Store Data Analysis

## 1. Project Description

## 2. Setup

**Installing ipython-sql**

In [37]:
!pip3 install ipython-sql

**Loading the database**

In [5]:
%%capture
%load_ext sql
%sql sqlite:///chinook.db

**Getting familiar with the database**

In [6]:
%%sql
SELECT
    name,
    type
FROM sqlite_master
WHERE type IN ("table","view");

 * sqlite:///chinook.db
Done.

[('album', 'table'),
 ('artist', 'table'),
 ('customer', 'table'),
 ('employee', 'table'),
 ('genre', 'table'),
 ('invoice', 'table'),
 ('invoice_line', 'table'),
 ('media_type', 'table'),
 ('playlist', 'table'),
 ('playlist_track', 'table'),
 ('track', 'table')]

In [12]:
%%sql
SELECT * FROM album
LIMIT 1;

 * sqlite:///chinook.db
Done.

[(1, 'For Those About To Rock We Salute You', 1)]

In [13]:
%%sql
SELECT * FROM artist
LIMIT 1;

 * sqlite:///chinook.db
Done.

[(1, 'AC/DC')]

In [11]:
%%sql
SELECT * FROM customer
LIMIT 1;

 * sqlite:///chinook.db
Done.

[(1, 'Luís', 'Gonçalves', 'Embraer - Empresa Brasileira de Aeronáutica S.A.', 'Av. Brigadeiro Faria Lima, 2170', 'São José dos Campos', 'SP', 'Brazil', '12227-000', '+55 (12) 3923-5555', '+55 (12) 3923-5566', 'luisg@embraer.com.br', 3)]

In [14]:
%%sql
SELECT * FROM invoice
LIMIT 2;

 * sqlite:///chinook.db
Done.

[(1, 18, '2017-01-03 00:00:00', '627 Broadway', 'New York', 'NY', 'USA', '10012-2612', 15.84),
 (2, 30, '2017-01-03 00:00:00', '230 Elgin Street', 'Ottawa', 'ON', 'Canada', 'K2P 1L7', 9.9)]

In [15]:
%%sql
SELECT * FROM genre
LIMIT 2;

 * sqlite:///chinook.db
Done.

[(1, 'Rock'), (2, 'Jazz')]

In [20]:
%%sql
SELECT * FROM invoice_line
LIMIT 2;

 * sqlite:///chinook.db
Done.

[(1, 1, 1158, 0.99, 1), (2, 1, 1159, 0.99, 1)]

In [25]:
%%sql
SELECT * FROM track
LIMIT 2;

 * sqlite:///chinook.db
Done.

[(1, 'For Those About To Rock (We Salute You)', 1, 1, 1, 'Angus Young, Malcolm Young, Brian Johnson', 343719, 11170334, 0.99),
 (2, 'Balls to the Wall', 2, 2, 1, None, 342562, 5510424, 0.99)]

## 3. Best-Selling Genres

<br>Invoice Line table doesnt directly contain information on genres, however, 
<br>it has a foreign key to the track table from which the genre information can be retrieved.

In [63]:
%%sql
WITH 
    genre_count AS
    (
        SELECT g.name AS genre, COUNT(il.quantity) AS number_of_tracks_sold
        FROM invoice_line AS il
        INNER JOIN track AS t ON il.track_id = t.track_id
        INNER JOIN genre g ON t.genre_id = g.genre_id
        GROUP BY genre
        ORDER BY number_of_tracks_sold DESC
    ),
    total AS
    (
        SELECT COUNT(*) AS total_sold FROM invoice_line
    )

SELECT gc.genre AS genre, 
        gc.number_of_tracks_sold AS number_sold, 
        (CAST(gc.number_of_tracks_sold AS REAL) / t.total_sold)*100 AS percentage 
FROM genre_count gc, total t;

 * sqlite:///chinook.db
Done.

[('Rock', 2635, 55.3920538154299),
 ('Metal', 619, 13.012402774858103),
 ('Alternative & Punk', 492, 10.342652932520496),
 ('Latin', 167, 3.510615934412445),
 ('R&B/Soul', 159, 3.3424427159974774),
 ('Blues', 124, 2.606684885431995),
 ('Jazz', 121, 2.543619928526382),
 ('Alternative', 117, 2.4595333193188984),
 ('Easy Listening', 74, 1.5556022703384484),
 ('Pop', 63, 1.3243640950178683),
 ('Electronica/Dance', 55, 1.156190876602901),
 ('Classical', 47, 0.9880176581879335),
 ('Reggae', 35, 0.7357578305654824),
 ('Hip Hop/Rap', 33, 0.6937145259617407),
 ('Heavy Metal', 8, 0.16817321841496743),
 ('Soundtrack', 5, 0.10510826150935462),
 ('TV Shows', 2, 0.04204330460374186),
 ('Drama', 1, 0.02102165230187093)]

> The 5 top-selling genres are Rock, Metal, Alternative & Punk, Latin and R&B/Soul. The store shall consider this info when buying new tracks.

## 4. Top Sales Agents

In [83]:
%%sql
WITH 
    customer_spent AS
    (
        SELECT c.customer_id AS customer, 
                SUM(i.total) AS total_spent
        FROM invoice i
        INNER JOIN customer c ON i.customer_id = c.customer_id
        GROUP BY c.customer_id
        ORDER BY total_spent DESC
    ),
    employee_customer AS
    (
        SELECT e.first_name || " " || e.last_name AS sales_agent_name,
                c.customer_id AS customer
        FROM employee e
        LEFT JOIN customer c ON c.support_rep_id = e.employee_id
    )

SELECT ec.sales_agent_name, SUM(cs.total_spent) AS total_sales
FROM customer_spent cs
INNER JOIN employee_customer ec ON ec.customer = cs.customer
GROUP BY ec.sales_agent_name
ORDER BY total_sales DESC;

 * sqlite:///chinook.db
Done.

[('Jane Peacock', 1731.5099999999998),
 ('Margaret Park', 1584.0),
 ('Steve Johnson', 1393.92)]

> The top-performing Sales Agent is Jane.